IDEA Open Model
SteelSetup Class
 ISteelSetup
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupAISC
 IdeaRS.OpenModel.SteelSetupAUS
 IdeaRS.OpenModel.SteelSetupCISC
 IdeaRS.OpenModel.SteelSetupECEN
 IdeaRS.OpenModel.SteelSetupRUS
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public abstract class SteelSetup
Public MustInherit Class SteelSetup
public ref class SteelSetup abstract
The SteelSetup type exposes the following members.
Constructors
Name | Description
SteelSetup
Initializes a new instance of the SteelSetup class
Top
See Also
Reference
IdeaRS.OpenModel Namespace